prompt:
  magma: 'magma'
  gap: 'gap'
  sage: 'sage'

logo:
  magma: <img src = "https://i.stack.imgur.com/0468s.png" width="50px">
  gap: <img src = "https://gap.math.u-bordeaux.fr/logo/Logo%20Couleurs/Logo_GAP-GP_Couleurs_L150px.png" width="50px">
  sage: <img src ="https://www.sagemath.org/pix/sage_logo_new.png" width = "50px">

comment:
  magma: |
    //
  gap: |
    #
  sage: |
    #

not-implemented:
  magma: |
    // (not yet implemented)
  gap: |
    # (not yet implemented)
  sage: |
    # (not yet implemented)


presentation:
  comment: Define the group with the given generators and relations
  magma: G := PCGroup({pccodelist}); {gens} := Explode({used_gens}); AssignNames(~G, {magma_assign});
  gap: G := PcGroupCode({pccode},{ordgp}); {gap_assign}


permutation:
  comment: Define the group as a permutation group
  magma: G := PermutationGroup< {deg} | {perms} >;
  gap: G := Group( {perms} );
  sage: G = PermutationGroup([{perms_sage}])


GLZ:
  comment: Define the group as a matrix group with coefficients in Z
  magma: G := MatrixGroup< {nZ}, Integers() | {LZ} >;
  gap: G := Group({LZsplit});


GLFp:
  comment: Define the group as a matrix group with coefficients in GLFp
  magma: G := MatrixGroup< {nFp}, GF({Fp}) | {LFp} >;
  gap: G := Group({LFpsplit});

GLZN:
  comment: Define the group as a matrix group with coefficients in GLZN
  magma: G := MatrixGroup< {nZN}, Integers({N}) | {LZN} >;
  gap: G := Group({LZNsplit});

GLZq:
  comment: Define the group as a matrix group with coefficients in GLZq
  magma: G := MatrixGroup< {nZq}, Integers({Zq}) | {LZq} >;
  gap: G := Group({LZqsplit});

GLFq:
  comment: Define the group as a matrix group with coefficients in GLFq
  magma: F:=GF({Fq}); al:=F.1; G := MatrixGroup< {nFq}, F | {LFq} >;
  gap: G := Group({LFqsplit});

transitive:
  comment: Define the group from the transitive group database
  magma: G := TransitiveGroup(d,n);
  gap: G := TransitiveGroup(d,n);
  sage: G = TransitiveGroup(d,n)

order:
  comment: Order of the group
  magma: Order(G);
  gap: Order(G);
  sage:  G.order()

exponent:
  comment: Exponent of the group
  magma: Exponent(G);
  gap: Exponent(G);
  sage:  G.exponent()

automorphism_group:
  comment: Automorphism group
  gap: AutomorphismGroup(G);
  magma: AutomorphismGroup(G);

composition_factors:
  comment: Composition factors of the group
  magma: CompositionFactors(G);
  gap:  CompositionSeries(G);
  sage:  G.composition_series()

nilpotency_class:
  comment:  Nilpotency class of the group
  magma: NilpotencyClass(G);
  gap: NilpotencyClassOfGroup(G);

derived_length:
  comment:  Derived length of the group
  magma:  DerivedLength(G);
  gap: DerivedLength(G);

conjugacy_classes:
  comment: List of conjugacy classes of the group
  magma: ConjugacyClasses(G);  // Output not guaranteed to exactly match the LMFDB table
  gap:  ConjugacyClasses(G);   // Output not guaranteed to exactly match the LMFDB table
  sage: G.conjugacy_classes()  # Output not guaranteed to exactly match the LMFDB table

primary_decomposition:
  comment:  The primary decomposition of the group
  gap:  AbelianInvariants(G);

abelianization:
  comment:  The abelianization of the group
  magma:  quo< G | CommutatorSubgroup(G)>;
  gap:  FactorGroup(G, DerivedSubgroup(G));

schur_multiplier:
  comment:  The Schur multiplier of the group
  gap:  AbelianInvariantsMultiplier(G);

commutator_length:
  comment:  The commutator length of the group
  gap: CommutatorLength(G);

subgroups:
  comment:  List of subgroups of the group
  magma:  Subgroups(G);
  gap:  AllSubgroups(G);
  sage:   G.subgroups()

center:
  comment: Center of the group
  magma: Center(G);
  gap:  Center(G);
  sage:  G.center()

commutator_subgroup:
  comment: Commutator subgroup of the group G
  magma:  CommutatorSubgroup(G);
  gap:  DerivedSubgroup(G);
  sage:  G.commutator()

frattini_subgroup:
  comment: Frattini subgroup of the group G
  magma:  FrattiniSubgroup(G);
  gap: FrattiniSubgroup(G);
  sage:  G.frattini_subgroup()

fitting_subgroup:
  comment:  Fitting subgroup of the group G
  magma:  Fitting(G);
  gap:  FittingSubgroup(G);
  sage:  G.fitting_subgroup()

radical:
  comment: Radical of the group G
  magma:  Radical(G);
  gap: SolvableRadical(G);

socle:
  comment:  Socle of the group G
  magma: Socle(G);
  gap:  Socle(G);
  sage:  G.socle()

derived_series:
  comment:  Derived series of the group GF
  magma:  DerivedSeries(G);
  gap: DerivedSeriesOfGroup(G);
  sage: G.derived_series()

chief_series:
  comment:  Chief series of the group G
  magma:  ChiefSeries(G);
  gap: ChiefSeries(G);

lower_central_series:
  comment:  The lower central series of the group G
  magma:  LowerCentralSeries(G);
  gap: LowerCentralSeriesOfGroup(G);
  sage: G.lower_central_series()

upper_central_series:
  comment: The upper central series of the group G
  magma:  UpperCentralSeries(G);
  gap: UpperCentralSeriesOfGroup(G);
  sage: G.upper_central_series()

character_table:
  comment: Character table
  magma: CharacterTable(G);  // Output not guaranteed to exactly match the LMFDB table
  gap:   CharacterTable(G);  // Output not guaranteed to exactly match the LMFDB table
  sage:  G.character_table()  # Output not guaranteed to exactly match the LMFDB table

